// 1. Объявить переменную, вывести в консоли 

let str = "Hello!";
console.log(str);

// 2. Объявить константу, вывести в консоли 

let STR = "Hello Tanya!";
console.log(STR);

//https://learn.javascript.ru/variables tasks
/* №1 
Объявите две переменные: admin и name.
Запишите строку "Джон" в переменную name.
Скопируйте значение из переменной name в admin.
Выведите на экран значение admin, используя функцию alert (должна показать «Джон»).
*/

let admin;
let name;

name = "Джон";
admin = name;

alert(admin);

/* №2 
Создайте переменную для названия нашей планеты. Как бы вы её назвали?
Создайте переменную для хранения имени текущего посетителя сайта. Как бы вы назвали такую переменную?
*/

const EARTH;
const currentUser;

/* №3 
Создайте переменную для названия нашей планеты. Как бы вы её назвали?
Создайте переменную для хранения имени текущего посетителя сайта. Как бы вы назвали такую переменную?
*/